Documents/Поступление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Поступление</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Склады</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерДокументаДоставщика</Name>
					<Comment>Номер документа по данным поставщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент-поставщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>Склад поступления</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма документа, с учетом НДС</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключенВСтоимость</Name>
					<Comment>НДС включен</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенкулатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Кол-во х Цена</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма х Значение ставки НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Comment>Сумма + Сумма НДС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Поступление/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьКонтрагентовПоставщиковПоТексту(ТекстПоиска) 
    Результат = Новый Массив;
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |  Контрагенты.Ссылка КАК Ссылка,
        |  Контрагенты.Наименование КАК Наименование
        |ИЗ
        |  Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |  Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Поставщик)
        |  И Контрагенты.Наименование ПОДОБНО &ТекстПоиска";
    
    Запрос.УстановитьПараметр("ТекстПоиска", ТекстПоиска + "%");
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        Строка = Новый Структура("Ссылка, Наименование", ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование);  
        Результат.Добавить(Строка);
    КонецЦикла;
        
    Возврат Результат;
КонецФункции


&НаКлиенте
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если СтрДлина(Текст) < 1 Тогда  
        Возврат; 
	КонецЕсли;
	
	Результат = ПолучитьКонтрагентовПоставщиковПоТексту(Текст);                          
	Список = Новый СписокЗначений;  
	
	Для Каждого Строка Из Результат Цикл
    	Список.Добавить(Строка.Ссылка, Строка.Наименование);
	КонецЦикла;     
		
	ДанныеВыбора = Список;
КонецПроцедуры

&НаСервере
Процедура СуммаПриИзмененииНаСервере()
	ОбщаяСумма = 0;
	
	Для каждого СтрокаТЧ из Объект.Товары Цикл
		ОбщаяСумма = ОбщаяСумма + СтрокаТЧ.Всего;
	КонецЦикла;
	
	Объект.Сумма = ОбщаяСумма;
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	СуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВсегоПриИзменении(Элемент)
	СуммаПриИзмененииНаСервере();
КонецПроцедуры            

&НаСервере
Процедура ПересчитатьТовары()  
    Для каждого Строка Из Объект.Товары Цикл
        Строка.Сумма = Строка.Количество * Строка.Цена;
        ПроцентНДС = Перечисления.СтавкиНДС.ПолучитьПроцентСтавкиНДС(Строка.НДС);
        
        Если Объект.НДСВключенВСтоимость Тогда
            Строка.СуммаНДС = Строка.Сумма - (Строка.Сумма / (1 + ПроцентНДС / 100));
            Строка.Всего = Строка.Сумма;
        Иначе
            Строка.СуммаНДС = Строка.Сумма * ПроцентНДС / 100;
            Строка.Всего = Строка.Сумма + Строка.СуммаНДС;
        КонецЕсли;
	КонецЦикла;
	СуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    ПересчитатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНДСПриИзменении(Элемент)
	ПересчитатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура НДСВключенВСтоимостьПриИзменении(Элемент)
	ПересчитатьТовары();
КонецПроцедуры


&НаКлиенте
Процедура КомандаГрупповоеИзменениеНДС(Команда) 
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаГрупповоеИзменениеНДСОкончание", ЭтаФорма);
	ОткрытьФорму("Перечисление.СтавкиНДС.ФормаВыбора",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура КомандаГрупповоеИзменениеНДСОкончание(Результат, ДополнительныеПараметры) Экспорт
	Для каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.НДС = Результат;
	КонецЦикла;
	ПересчитатьТовары();
КонецПроцедуры


//&НаКлиенте
//Асинх Процедура КомандаГрупповоеИзменениеНДС(Команда) 
//	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаГрупповоеИзменениеНДСОкончание", ЭтаФорма);
//    Обещание = ОткрытьФорму("Перечисление.СтавкиНДС.ФормаВыбора",, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОписаниеОповещения);
//    Результат = Ждать Обещание;
//    Для каждого СтрокаТЧ Из Объект.Товары Цикл
//        СтрокаТЧ.НДС = Результат;
//    КонецЦикла;
//КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
        Сообщить("Не указана дата документа.");
        Отказ = Истина;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
        Сообщить("Не заполнено значение поля «Склад».");
        Отказ = Истина;
    КонецЕсли;
    
    Для Каждого СтрокаТЧ Из Объект.Товары Цикл
        Если Не ЗначениеЗаполнено(СтрокаТЧ.Количество) Или СтрокаТЧ.Количество <= 0 Тогда
            Сообщить("В строке " + СтрокаТЧ.НомерСтроки + " табличной части не заполнено поле «Количество».");
            Отказ = Истина;
        КонецЕсли;
	КонецЦикла;    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
